# -*- coding: utf-8 -*-
print '\t\tDZ3: Функције. Класе.\n'
print '\n\t1. resenje:\n'
# 1. Написати у модулу Sfera класу Sfera такву да садржи:
#  Атрибуте: полупречник и координате центра (xCentar, yCentari, zCentar);
#  Конструктор сфере са задатим центром и полупречником;
#  Дефинисати подразумеване вредности атрибута приликом иницијализације (јединична сфера са центром у координатном
# почетку);
#  Класну променљиву која броји објекте класе;
#  Статички метод који враћа укупан број креираних објеката класе;
#  Инстанцни метод за рачунање запремине лопте.
# Написати у модулу TestSfera главни програм такав да се у њему извршава:
#  Испис броја објеката који су формирани (позивом одговарајућег метода) пре него што је формиран иједан објекат;
#  Креирање објеката:
# o sfera – објекат у координатном почетку, полупречника 4.0;
# o globus (12, 1.0, 1.0, 1.0);
# o bilijarska_lopta (10.0, 10.0, 0.0);
# o jedinicna_sfera – објекат у координатном почетку, полупречника 1.0;
#  Испис броја објеката који су формирани;
#  Испис запремине сваког претходно креираног објекта.


print '\n\t2. resenje:\n'
# 2. Написати у модулу Geometrija класу Tacka такву да садржи:
#  Инстанцне променљиве x и y (координате тачке);
#  Конструктор на основу задатих x и y координата тачке;
#  Метод за померање Тацке по x и y оси за x_pomeraj, y_pomeraj;
#  Метод за рачунање растојања до задате тачке.
# Написати у модулу Geometrija класу Duz такву да садржи:
#  Инстанцне променљиве, почетна и крајња тачка дужи
#  Конструктор на основу задате почетне и крајње тачке дужи;
#  Методу за креирање дужи на основу задате x и y координате почетне тачке и x и y координате крајње тачке;
#  Метод за рачунање дужине дужи
# Написати у модулу TestGeometrija главни програм такав да се у њему извршава:
#  Креирање две тачке (почетак (x_poc, y_poc) и крај (x_zav, y_zav)) на основу уноса корисника са стандардног улаза;
#  Креирање дуж чија су почетна и крајња тачка баш ове задате тачке;
#  Креирање друге дуж са задатим координатама почетне и крајње тачке;
#  Испис које дужи су формиране;
#  Померање тачке крај за (dx, dy) на основу уноса корисника са стандардног улаза;
#  Испис нове дуж.

print '\n\t3. resenje:\n'
# 3. Написати python модул/пакет за потребе извођења основних статистичких анализа површи терена. У фази израде
# програма, површ је потребно задати као скуп (псеудо)случајних тачака на основу корисничког уноса броја тачака
#  са стандардног улаза (главни програм који тестира развијене функционалности модула/пакета). О креираној површи
#  је потребно водити метаподатке о ономе ко анализира површ, броју тачака површи. Над креираном површи треба обезбедити
#  могућност рачунања средње вредности површи, рачунање минималне и максималне вредности координата тачака површи
# тј. минималног обухватног правоугаоника. За сваку од тачака потребно је водити метаподатке о броју тачке који се
#  додељује произвољно али теба да је јединствен. Омогућити функционалност рачунања најближе тачке некој тачки,
#  као и интерполацију вредности висине дуж правца између две тачке а која ће бити корисна код каснијег рачунања положаја изохипси.
#  Написати главни програм који тестира претходно развијене функционалности.


print '\n\t4. resenje:\n'
# 4. Написати у модулу Inzenjer класу Inzenjer такву да садржи:
# Атрибуте:
#  Име инжењера;
#  Презиме инжењера;
#  Матични број лица;
#  Лиценца.
# Методе:
#  Одговарајуће getter и setter методе (нема јавних атрибута);
#  Испис информација о инжењеру.
# Написати у модулу Inzenjer класу GeodetskiInzenjer која наслеђује класу Inženjer а садржи још:
# Атрибути:
#  Број година радног стажа
# Методе:
#  Одговарајуће getter и setter методе за ненаслеђене атрибуте (нема јавних атрибута)
#  Испис свих информација о геодетском инжењеру
#  Исписи информације о лиценци уколико је има, уколико је нема треба само исписати да инжењер нема лиценцу
# Написати у модулу Inzenjer класу ElektrotehnickiInzenjer која наслеђује класу Inzenjer а садржи још:
# Атрибути:
#  Број пројеката на којима је до сада радио
# Методе:
#  Одговарајуће getter и setter методе за ненаслеђене атрибуте (нема јавних атрибута)
#  Испис свих информација о инжењеру електротехнике
#  Исписи информације о лиценци уколико је има, уколико је нема треба само исписати да инжењер нема лиценцу


print '\n\t5. resenje:\n'
# 5. Написати у модулу Osoba одговарајуће класе које ће омогућити обраду података о категоријама особа у складу са
# следећим описом:
# Податке о особи чини име, презиме, датум рођења и адреса становања. Ђак је особа за коју се зна назив основне школе,
#  одељење у које иде и година уписа школе. Запослен је особа за коју се зна назив компаније и департмана у ком је запослен,
#  датум закључења и прекид радног односа са свим компанијама у којима је претходно радио/ради. За сваку од категорија особа
# омогућити унос и испис свих информација о конкретној особи. За сваког ђака потребно је омогућити добијање информације о томе
#  који разред школе ђак тренутно похађа, као и да ли је можда обновио неку годину током школовања (није важно коју!).
# За сваког запосленог потребно је омогућити добијање информација о укупном радном стажу запосленог изражену у месецима
# (претпоставља се да месец има 30 дана!).
# Написати главни програм који тестира написане класе. Подаци о особама уносе са стандардног улаза и исписују на
# стандардни излаз.
